app/controllers/contacts_controller.rb

SELECT * FROM "contacts" WHERE ("contacts"."id" = 1)
---
  def show
    @contact = Contact.find(params[:id])

INSERT INTO "contacts" ("updated_at", "title", "site", "content", "email", "created_at") VALUES('2009-02-13 16:37:17', 'Hello ', 'http://test.com', 'what''s up ', 'test@foo.com', '2009-02-13 16:37:17')
---
  def create
    @page_title = "rociiu | contact"
    @contact = Contact.new(params[:contact])

    respond_to do |format|
      if @contact.save