app/controllers/posts_controller.rb

  def index
    @page_title = "rociiu | archives"
    if logged_in?
      @posts = Post.all
---
SELECT * FROM "posts"

  def show
    @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE (id > 1 and display='t') LIMIT 1

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("updated_at", "title", "display", "content", "created_at") VALUES('2009-02-08 02:43:10', 'Hello , My blog', 't', 'Hello world', '2009-02-08 02:43:10')

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 5)
UPDATE "posts" SET "display" = 't', "content" = '^hello^', "updated_at" = '2009-02-10 13:39:21' WHERE "id" = 6

  def export
    if logged_in?
      @posts = Post.all
---
SELECT * FROM "posts"